import React from 'react'

import { Modal } from './'

import { FormikInput, FormikPhoneInput } from '../admin/components/'
import { Formik, Field, Form, ErrorMessage } from 'formik';
import cn from 'classnames'

import modal_img from '../static/modal_img.webp'

import axios from 'axios'

const ModalRecord = ({ closeClick }) => {
    const [personalCheckboxValue, setPersonalCheckboxValue] = React.useState(false)

    const [isSubmit, setIsSubmit] = React.useState(false)

    const initialValues = {
        fio: '',
        phone: ''
    }

    const onSubmit = (fields, { setStatus, setSubmitting, resetForm }) => {
        setStatus();
        axios.post('/api/records/add', fields).then(({ data }) => {
            setIsSubmit(true)
        })
        setSubmitting();
        resetForm({})
    }

    return (
        <Modal closeClick={closeClick}>
            {!isSubmit ?
                <div className="modal_record">
                    <span className="modal_record__close close_btn" onClick={closeClick}>
                        &times;
                    </span>
                    <div className="modal_record__info-wrapper">
                        <div className="modal_record__info">
                            <h2 className="modal_record__info__title">Запись</h2>
                            <p className="modal_record__info__text">
                                Введите свои данные и мы свяжемся с вами в течении суток
                            </p>
                            <Formik initialValues={initialValues} onSubmit={onSubmit} >
                                {/* <Formik initialValues={initialValues} validationSchema={validationSchema} onSubmit={onSubmit} > */}
                                <Form className="modal_record__info__form">
                                    <div className="modal_record__info__form__input-wrapper">
                                        <Field
                                            className="attendance__form__field"
                                            component={FormikInput}
                                            name="fio"
                                            label='ФИО'
                                            size='m'
                                            view='line'
                                            nameComponent='fio'
                                            id='fio'
                                            width='available'
                                            theme="alfa-on-color"
                                        // className={cn('form-control', { 'is-invalid': errors[formObj.name] && touched[formObj.name] })}
                                        />
                                    </div>
                                    <div className="modal_record__info__form__input-wrapper">
                                        <Field
                                            className="attendance__form__field"
                                            component={FormikPhoneInput}
                                            name="phone"
                                            label='Номер телефона'
                                            size='m'
                                            view='line'
                                            nameComponent='phone'
                                            id='phone'
                                            width='available'
                                            mask="+1 (111) 111 1111"
                                            theme="alfa-on-color"
                                        // className={cn('form-control', { 'is-invalid': errors[formObj.name] && touched[formObj.name] })}
                                        />
                                    </div>
                                    <div className="modal_record__info__form__checkbox_block">
                                        <input
                                            type="checkbox"
                                            className="modal_record__info__form__checkbox_block-checkbox"
                                            checked={personalCheckboxValue}
                                            onChange={() => setPersonalCheckboxValue(prev => !prev)}
                                        />
                                        <a href='/personal_data' target="_blank" className="modal_record__info__form__checkbox_block-link">
                                            Я согласен на обработкой персональных данных
                                        </a>
                                    </div>
                                    <button
                                        className={cn('modal_record__info__form__btn', 'enrollment')}
                                    >
                                        Записаться
                                </button>
                                </Form>
                            </Formik>
                            <p className="modal_record__info__text">
                                Либо свяжитесь с нами:
                            </p>
                            <p className="modal_record__info__text phone">
                                (095) 49-75-015
                            </p>
                            <ul className="modal_record__info__social">
                                <li className="modal_record__info__social__item">
                                    <a href="https://www.telegram.com/" target="_blank" rel="noreferrer">
                                        <svg width="26" height="24" viewBox="0 0 26 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M25.5986 1.5827C25.281 1.19431 24.8053 0.980469 24.259 0.980469C23.962 0.980469 23.6474 1.04295 23.3241 1.16653L1.31559 9.56786C0.147624 10.0136 -0.00967903 10.6825 0.000437535 11.0415C0.0105541 11.4005 0.205546 12.0595 1.39692 12.4386C1.40406 12.4408 1.4112 12.4429 1.41835 12.4449L5.9835 13.7514L8.45234 20.8111C8.78897 21.7736 9.54454 22.3715 10.4245 22.3715C10.9793 22.3715 11.525 22.139 12.0027 21.6994L14.8264 19.0995L18.922 22.3973C18.9224 22.3977 18.923 22.3979 18.9234 22.3983L18.9623 22.4296C18.9658 22.4324 18.9696 22.4353 18.9732 22.4381C19.4284 22.7912 19.9253 22.9777 20.4107 22.9779H20.4109C21.3593 22.9779 22.1145 22.2759 22.3345 21.1896L25.9405 3.38365C26.0853 2.66895 25.9639 2.02942 25.5986 1.5827ZM7.51071 13.5032L16.3183 9.00371L10.8341 14.8311C10.7442 14.9265 10.6806 15.0433 10.6492 15.1705L9.59175 19.4539L7.51071 13.5032ZM10.9706 20.5787C10.9341 20.6122 10.8974 20.6421 10.8607 20.6697L11.8418 16.6961L13.6265 18.1332L10.9706 20.5787ZM24.4474 3.08115L20.8414 20.8873C20.8067 21.0577 20.6958 21.4542 20.4107 21.4542C20.2699 21.4542 20.093 21.3775 19.9118 21.238L15.2709 17.5012C15.2703 17.5006 15.2695 17.5 15.2687 17.4996L12.5073 15.276L20.4381 6.84888C20.692 6.5791 20.715 6.16591 20.4927 5.86955C20.2701 5.5732 19.8668 5.47997 19.5369 5.64857L6.4929 12.3124L1.86566 10.9885L23.8674 2.5898C24.0533 2.51878 24.183 2.50391 24.259 2.50391C24.3056 2.50391 24.3885 2.50946 24.4193 2.54735C24.4597 2.59674 24.5113 2.76515 24.4474 3.08115Z" fill="white" stroke="#141414" strokeWidth="0.7" />
                                        </svg>
                                    </a>
                                </li>
                                <li className="modal_record__info__social__item">
                                    <a href="https://www.instagram.com/" target="_blank" rel="noreferrer">
                                        <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0)">
                                                <path d="M13.2559 26.0004C13.1698 26.0004 13.0837 26.0004 12.997 26C10.959 26.0049 9.07596 25.9532 7.24466 25.8417C5.5657 25.7395 4.03314 25.1593 2.81241 24.1639C1.63452 23.2034 0.830154 21.9048 0.421722 20.3043C0.0662537 18.911 0.0474091 17.5433 0.0293579 16.2204C0.0162658 15.2712 0.0027771 14.1465 0 13.0027C0.0027771 11.8542 0.0162658 10.7295 0.0293579 9.78032C0.0474091 8.45762 0.0662537 7.0899 0.421722 5.69639C0.830154 4.09599 1.63452 2.79729 2.81241 1.83681C4.03314 0.84142 5.5657 0.261204 7.24486 0.159046C9.07616 0.0477634 10.9596 -0.00420808 13.002 0.000751034C15.0406 -0.00361298 16.923 0.0477634 18.7543 0.159046C20.4333 0.261204 21.9659 0.84142 23.1866 1.83681C24.3647 2.79729 25.1689 4.09599 25.5773 5.69639C25.9328 7.0897 25.9516 8.45762 25.9697 9.78032C25.9827 10.7295 25.9964 11.8542 25.999 12.998V13.0027C25.9964 14.1465 25.9827 15.2712 25.9697 16.2204C25.9516 17.5431 25.933 18.9108 25.5773 20.3043C25.1689 21.9048 24.3647 23.2034 23.1866 24.1639C21.9659 25.1593 20.4333 25.7395 18.7543 25.8417C17.0006 25.9484 15.1991 26.0004 13.2559 26.0004ZM12.997 23.9687C15.0019 23.9735 16.8427 23.9229 18.631 23.8142C19.9005 23.737 21.0012 23.325 21.903 22.5897C22.7365 21.9099 23.3106 20.972 23.6091 19.8021C23.9051 18.6423 23.9221 17.3969 23.9386 16.1926C23.9515 15.2498 23.965 14.133 23.9678 13.0004C23.965 11.8675 23.9515 10.7509 23.9386 9.80809C23.9221 8.60382 23.9051 7.35849 23.6091 6.19845C23.3106 5.0285 22.7365 4.09063 21.903 3.41083C21.0012 2.6757 19.9005 2.26369 18.631 2.18653C16.8427 2.07763 15.0019 2.02744 13.0018 2.0318C10.9973 2.02704 9.1563 2.07763 7.36804 2.18653C6.09851 2.26369 4.99779 2.6757 4.09602 3.41083C3.2625 4.09063 2.68843 5.0285 2.38989 6.19845C2.09393 7.35849 2.07687 8.60362 2.06041 9.80809C2.04752 10.7517 2.03403 11.8691 2.03125 13.0027C2.03403 14.1314 2.04752 15.249 2.06041 16.1926C2.07687 17.3969 2.09393 18.6423 2.38989 19.8021C2.68843 20.972 3.2625 21.9099 4.09602 22.5897C4.99779 23.3248 6.09851 23.7368 7.36804 23.814C9.1563 23.9229 10.9977 23.9737 12.997 23.9687ZM12.9486 19.348C9.44868 19.348 6.60097 16.5005 6.60097 13.0004C6.60097 9.50023 9.44868 6.65271 12.9486 6.65271C16.4488 6.65271 19.2963 9.50023 19.2963 13.0004C19.2963 16.5005 16.4488 19.348 12.9486 19.348ZM12.9486 8.68396C10.5686 8.68396 8.63222 10.6204 8.63222 13.0004C8.63222 15.3803 10.5686 17.3168 12.9486 17.3168C15.3288 17.3168 17.265 15.3803 17.265 13.0004C17.265 10.6204 15.3288 8.68396 12.9486 8.68396ZM20.0072 4.62145C19.166 4.62145 18.4838 5.30343 18.4838 6.14489C18.4838 6.98635 19.166 7.66833 20.0072 7.66833C20.8487 7.66833 21.5307 6.98635 21.5307 6.14489C21.5307 5.30343 20.8487 4.62145 20.0072 4.62145Z" fill="white" stroke="#222222" />
                                            </g>
                                            <defs>
                                                <clipPath id="clip0">
                                                    <rect width="26" height="26" fill="white" />
                                                </clipPath>
                                            </defs>
                                        </svg>
                                    </a>
                                </li>
                                <li className="modal_record__info__social__item">
                                    <a href="https://www.vider.com/" target="_blank" rel="noreferrer">
                                        <svg width="24" height="26" viewBox="0 0 24 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M14.5005 0H9.4995C4.2615 0 0 4.21904 0 9.40508V13.8662C0 17.7283 2.3965 21.1992 6 22.6128V25.5049C6 25.7009 6.1165 25.8782 6.2975 25.9574C6.3625 25.9861 6.4315 26 6.5 26C6.6215 26 6.742 25.9559 6.8355 25.8718L9.735 23.2713H14.5005C19.7385 23.2713 24 19.0523 24 13.8662V9.40508C24 4.21904 19.7385 0 14.5005 0ZM23 13.8662C23 18.5061 19.1875 22.281 14.5005 22.281H9.542C9.418 22.281 9.2985 22.3266 9.2065 22.4093L7 24.3883V22.2697C7 22.0597 6.8665 21.8726 6.6665 21.8032C3.2775 20.6164 1 17.4267 1 13.8662V9.40508C1 4.76517 4.813 0.990269 9.4995 0.990269H14.5005C19.1875 0.990269 23 4.76517 23 9.40508V13.8662Z" fill="white" />
                                            <path d="M18.6091 15.0982L15.5361 13.1216C15.2001 12.9052 14.8001 12.8319 14.4086 12.9121C14.0166 12.9938 13.6796 13.2231 13.4611 13.5573L13.3166 13.7771C11.9866 13.3419 10.5201 12.7859 9.64212 10.2691L10.0056 9.9562C10.6296 9.41898 10.6951 8.47921 10.1526 7.86029L7.74861 5.1217C7.56761 4.91523 7.25162 4.89394 7.04311 5.07269L5.53361 6.37192C4.20961 7.51172 4.82811 9.19765 5.03161 9.75171C5.04061 9.77646 5.05161 9.80023 5.06461 9.8235C5.11711 9.91659 6.37061 12.1318 8.39511 14.1738C10.4276 16.2241 14.0971 18.1175 14.2096 18.1725C14.6286 18.4418 15.1001 18.571 15.5666 18.571C16.3856 18.571 17.1886 18.1734 17.6676 17.4446L18.7566 15.7839C18.9066 15.5537 18.8406 15.2472 18.6091 15.0982ZM16.8286 16.9049C16.3781 17.5922 15.4471 17.7872 14.7121 17.3179C14.6756 17.299 11.0301 15.419 9.10861 13.4806C7.31261 11.6689 6.12011 9.65614 5.95761 9.3754C5.56161 8.27571 5.63161 7.59985 6.18961 7.11957L7.32211 6.14515L9.39811 8.50991C9.58261 8.71985 9.56111 9.02683 9.35011 9.20854L8.73661 9.73636C8.58711 9.86509 8.52812 10.0686 8.58662 10.2558C9.63262 13.6217 11.6666 14.2827 13.1516 14.7654L13.3681 14.8362C13.5846 14.9085 13.8216 14.8258 13.9456 14.6367L14.3001 14.096C14.3731 13.9841 14.4851 13.9084 14.6151 13.8811C14.7456 13.8534 14.8786 13.8791 14.9916 13.9519L17.6456 15.6587L16.8286 16.9049Z" fill="white" />
                                            <path d="M13.143 8.04442C12.877 7.96866 12.6005 8.12166 12.525 8.38507C12.4495 8.64798 12.6035 8.92179 12.869 8.99656C13.614 9.2065 14.2075 9.79521 14.4175 10.5335C14.4795 10.7513 14.68 10.8944 14.8985 10.8944C14.9435 10.8944 14.989 10.8885 15.0345 10.8761C15.3 10.8018 15.455 10.5285 15.38 10.2651C15.0765 9.19857 14.219 8.34744 13.143 8.04442Z" fill="white" />
                                            <path d="M16.947 11.0014C16.992 11.0014 17.0375 10.9955 17.083 10.9831C17.349 10.9088 17.5035 10.635 17.4285 10.3721C16.8385 8.30094 15.174 6.64917 13.084 6.05996C12.8185 5.98421 12.542 6.1382 12.4665 6.40111C12.391 6.66403 12.545 6.93784 12.8105 7.0126C14.569 7.50774 15.9695 8.89857 16.466 10.6409C16.5285 10.8588 16.7285 11.0014 16.947 11.0014Z" fill="white" />
                                            <path d="M12.8677 3.75413C12.6017 3.67837 12.3252 3.83137 12.2497 4.09528C12.1742 4.35819 12.3282 4.632 12.5937 4.70677C15.5732 5.54602 17.9467 7.90187 18.7877 10.8544C18.8497 11.0722 19.0502 11.2153 19.2687 11.2153C19.3137 11.2153 19.3592 11.2094 19.4047 11.197C19.6702 11.1227 19.8252 10.8489 19.7502 10.586C18.8157 7.30474 16.1787 4.68746 12.8677 3.75413Z" fill="white" />
                                        </svg>
                                    </a>
                                </li>
                            </ul>
                            <p className="modal_record__info__email">
                                unitedbit@mail.ru
                            </p>
                        </div>
                    </div>
                    <img className="modal_record__img" src={modal_img} alt="modal_record_img" />
                </div>
                :
                <Modal closeClick={closeClick}>
                    <div className="modal_thank_you">
                        <span className="modal_record__close close_btn" onClick={closeClick}>
                            &times;
                        </span>
                        <div className="modal_thank_you__content">
                            <p className="modal_thank_you__content__text">Спасибо за запись, мы свяжемся с вами!</p>
                            <div className="modal_thank_you__content__img">

                            </div>
                        </div>
                    </div>
                </Modal>
            }

        </Modal >
    )
}

export default ModalRecord
